team/case6/plate/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) // 0
    (.20 0 0) // 1
    (1 0 0) // 2
    (0 1 0) // 3
    (.2 1 0) // 4
    (1 1 0) // 5
    (0 0 0.1) // 6
    (.20 0 0.1) // 7
    (1 0 0.1) // 8
    (0 1 0.1) // 9
    (.2 1 0.1) // 10
    (1 1 0.1) // 11
);

blocks
(
    hex (0 1 4 3 6 7 10 9) (20 100 1) simpleGrading (.1 15 1)
    hex (1 2 5 4 7 8 11 10) (80 100 1) simpleGrading (10 15 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 8 11 5)
        );
    }
    wall
    {
	type patch;
	faces
	(
	  (3 9 10 4)
	  (4 10 11 5)
	);
    }
    center
    {
        type symmetry;
        faces
        (
            (0 6 7 1)
        );
    }
    plate
    {
        type wall;
        faces
        (
            (1 7 8 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
